app/controllers/organizations_controller.rb

SELECT "organizations".* FROM "organizations"
---
  def index
    @organizations = Organization.all

SELECT  "organizations"."user_id" FROM "organizations" WHERE (user_id = 1) LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "organizations".* FROM "organizations" WHERE (user_id = 1)
---
  def candidatos_da_instituicao
    @organization = Organization.where(["user_id = ?", current_user.id]).select("user_id").take
    @jobs = Job.where(["user_id = ?", @organization.user.id])

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_organization
      @organization = Organization.find(params[:id])